10/data/attachments/749b32b7f5ed1f60.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_36349043-2038-4cee-871b-acfc033fc699</nif:username>
            <nif:friendToBeAdded>Chad_perform_Friend_87549_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>